In [20]:
import pandas as pd

# Example 1, Concat dataframe as a new row

In [21]:
india_weather = pd.DataFrame({
   'city': ['mumbai', 'delhi', 'banglore'],
   'temperature': [37, 65, 74],
   'humidity': [80, 60, 56]
})
india_weather

       city  temperature  humidity
0    mumbai           37        80
1     delhi           65        60
2  banglore           74        56

There are two dataframe of weathers from diff countries

In [22]:
nepal_weather = pd.DataFrame({
   'city': ['kailali', 'karnali', 'ktm'],
   'temperature': [65, 53, 45],
   'humidity': [45, 50, 61]
})
nepal_weather

      city  temperature  humidity
0  kailali           65        45
1  karnali           53        50
2      ktm           45        61

pandas concat function will returns a dataframe of list of dataframe combining in rows

In [23]:
df = pd.concat([india_weather, nepal_weather])
df

       city  temperature  humidity
0    mumbai           37        80
1     delhi           65        60
2  banglore           74        56
0   kailali           65        45
1   karnali           53        50
2       ktm           45        61

To ignore original index of dataframes

In [24]:
df = pd.concat([india_weather, nepal_weather], ignore_index=True)
df

       city  temperature  humidity
0    mumbai           37        80
1     delhi           65        60
2  banglore           74        56
3   kailali           65        45
4   karnali           53        50
5       ktm           45        61

Give Key to Map original dataframe

In [25]:
key_df = pd.concat([india_weather, nepal_weather], keys=["IND", "NEP"])
key_df

           city  temperature  humidity
IND 0    mumbai           37        80
    1     delhi           65        60
    2  banglore           74        56
NEP 0   kailali           65        45
    1   karnali           53        50
    2       ktm           45        61

To get quick back original data from this key values

In [26]:
key_df.loc["NEP"]

      city  temperature  humidity
0  kailali           65        45
1  karnali           53        50
2      ktm           45        61

# Example 2 => concat as new column

In [27]:
weather_temp = pd.DataFrame({
   'city': ['kailali', 'karnali', 'ktm'],
   'temperature': [65, 53, 45],
})
weather_temp

      city  temperature
0  kailali           65
1  karnali           53
2      ktm           45

In [28]:
weather_hum = pd.DataFrame({
   'city': ['kailali', 'karnali', 'ktm'],
   'humidity': [54, 23, 35],
})
weather_hum

      city  humidity
0  kailali        54
1  karnali        23
2      ktm        35

In [29]:
weather_df = pd.concat([weather_temp, weather_hum], keys=['temp', 'hum'])
weather_df

           city  temperature  humidity
temp 0  kailali         65.0       NaN
     1  karnali         53.0       NaN
     2      ktm         45.0       NaN
hum  0  kailali          NaN      54.0
     1  karnali          NaN      23.0
     2      ktm          NaN      35.0

- The default value of axis is 0 which means row
- When we pass axis=1 then it means concat the dataframe in columnar formal

In [30]:
weather_df = pd.concat([weather_temp, weather_hum], axis=1)
weather_df

      city  temperature     city  humidity
0  kailali           65  kailali        54
1  karnali           53  karnali        23
2      ktm           45      ktm        35

# Example 3, with series

In [34]:
print(f"{weather_temp}")
s = pd.Series(["humid", "dry", "Rain"], name="event")
s

      city  temperature
0  kailali           65
1  karnali           53
2      ktm           45

0    humid
1      dry
2     Rain
Name: event, dtype: object

In [35]:
s_df = pd.concat([weather_temp, s], axis=1)
s_df

      city  temperature  event
0  kailali           65  humid
1  karnali           53    dry
2      ktm           45   Rain